public/man/man1/xwayland.1/index.html
<!DOCTYPE html>
<html
    lang="en-us"
    dir="ltr"
>
    <head>
        <meta charset="utf-8">
<meta name="viewport" content="width=device-width,initial-scale=1">
<title>Manpages - Xwayland.1 | Technical Notes</title>

      <link rel="stylesheet" href="/css/main.min.a9ecaac9d4f7845fc2de4738f7709cab0bd1c3d19c3466fadd637a6987603257.css" integrity="sha256-qeyqydT3hF/C3kc493CcqwvRw9GcNGb63WN6aYdgMlc=" crossorigin="anonymous">


<link rel="stylesheet" href="/css/syntax.css">
        
        
    </head>
    <body>
        <header class="container header">
            <span class="header__title">Technical Notes</span>
<button id="menuOpenBtn" class="header__menu-open-btn"><i data-lucide="menu"></i></button>

  <nav id="siteNav">
    <ul>
    <li>
      <a href="/">Home</a>
    </li>
    <li>
      <a href="/notes/">Notes</a>
    </li>
    <li>
      <a aria-current="true" class="ancestor" href="/man/">Manpages</a>
    </li>
    <li>
      <a href="/search/">Search</a>
    </li>
    </ul>
    <button id="menuCloseBtn" class="header__menu-close-btn"><i data-lucide="x"></i></button>
  </nav>


        </header>
        <main class="container">
            
    <h1>Manpages - Xwayland.1</h1>
    
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
NAME
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<p>Xwayland - an X server for running X clients under Wayland.</p>
</div>
</div>
<div id="outline-container-headline-2" class="outline-2">
<h2 id="headline-2">
SYNOPSIS
</h2>
<div id="outline-text-headline-2" class="outline-text-2">
<p><strong>Xwayland</strong> [option …]</p>
</div>
</div>
<div id="outline-container-headline-3" class="outline-2">
<h2 id="headline-3">
DESCRIPTION
</h2>
<div id="outline-text-headline-3" class="outline-text-2">
<p><em>Xwayland</em> is an X server and a Wayland client. It plays the role of a
proxy between legacy X clients which do not support the Wayland
protocols and the Wayland server.</p>
<p>
Usually, <em>Xwayland</em> is spawned automatically by the Wayland server and
runs rootless so that X clients integrate seamlessly with the rest of
the Wayland desktop. It is however possible for a user to launch
Xwayland non-rootless, mainly for testing purposes.</p>
<p>
Like all of the X servers, <em>Xwayland</em> accepts the command line options
described in the /Xserver/(7) manual page. The following additional
arguments are supported as well.</p>
<dl>
<dt>
<strong>-decorate</strong>
</dt>
<dd>Add decorations to the Xwayland root window when
running rootful.

This option has no effect when <em>Xwayland</em> is built without libdecor
support (optional).

This option is not compatible with rootless mode (<em>-rootless</em>).</dd>
<dt>
<strong>-enable-ei-portal</strong>
</dt>
<dd>Enable support for the XDG portal for input
emulation.

A Wayland compositor running nested should not use that command line
option with Xwayland.

This option has no effect if the compositor doesn&#39;t support the
relevant XDG portal or if Xwayland was not compiled with EI and OEFFIS
support.</dd>
<dt>
<strong>-fullscreen</strong>
</dt>
<dd>Set the Xwayland window fullscreen when running
rootful.

This option is not compatible with rootless mode (<em>-rootless</em>).</dd>
<dt>
<strong>-geometry <em>WxH</em></strong>
</dt>
<dd>Sets the geometry of the <em>Xwayland</em> window to
<em>WxH</em> when running rootful.

This option is not compatible with rootless mode (<em>-rootless</em>).</dd>
<dt>
<strong>-glamor [/gl|es|off/]</strong>
</dt>
<dd>Use given rendering API for Glamor
acceleration. Possible options are <em>gl</em> and <em>es</em>. If <em>Xwayland</em> was
compiled with Glamor support, this option will instruct <em>Xwayland</em> to
use only requested API for Glamor. If this set to <em>off</em>, effect is
equal to <em>-shm</em> option. Without this option and without <em>-shm</em> option,
<em>Xwayland</em> tries the OpenGL rendering API first, and fallback to GL ES
if GL version is less than 2.1.

This option is not compatible with <em>-shm</em> option.</dd>
<dt>
<strong>-hidpi</strong>
</dt>
<dd>Adjust to the scale of the outputs when running rootful in
windowing mode.

This option is not compatible with rootless mode (<em>-rootless</em>).</dd>
<dt>
<strong>-host-grab</strong>
</dt>
<dd>Disable host keyboard shorcuts and confine the pointer
when running rootful.

This feature relies on the protocol for inhibiting the compositor
keyboard shortcuts and on the protocol for pointer locking and
confinement and may have no effect if the Wayland compositor in use
does not support these protocols.

Use the keys [CTRL]+[SHIFT] simultaneously to release the keyboard and
pointer devices.

This option is not compatible with rootless mode (<em>-rootless</em>).</dd>
<dt>
<strong>-initfd <em>fd</em></strong>
</dt>
<dd>Add the given <em>fd</em> as a listen socket for
initialization of X clients. This options is aimed at <em>Wayland</em>
servers which run <em>Xwayland</em> on-demand, to be able to spawn specific X
clients which need to complete before other regular X clients can
connect to <em>Xwayland</em>, like <em>xrdb</em>.</dd>
<dt>
<strong>-listen <em>fd</em></strong>
</dt>
<dd>deprecated, use <em>-listenfd</em> instead.</dd>
<dt>
<strong>-listenfd <em>fd\fP</em></strong>
</dt>
<dd>Add given fd as a listen socket. This option is
used by the <em>Wayland</em> server to pass <em>Xwayland the socket where X
clients connect.</em></dd>
<dt>
<strong>-noTouchPointerEmulation</strong>
</dt>
<dd>Disable touch pointer emulation. This
allows the Wayland compositor to implement its own pointer emulation
mechanism for X11 clients that don&#39;t support touch input.</dd>
<dt>
<strong>-force-xrandr-emulation</strong>
</dt>
<dd>Force additional non-native modes to be
exposed when viewporter is not supported by the Wayland compositor.</dd>
<dt>
<strong>-nokeymap</strong>
</dt>
<dd>Instructs <em>Xwayland to ignore the keymap set by the
Wayland compositor.</em>

By default, <em>Xwayland (as any Wayland client) uses the keymap set by
the</em> Wayland compositor using the standard Wayland protocol.

This option is meant for some specific use cases where it may be
desirable to let the X11 clients control the keymap used in Xwayland,
ignoring the keymap specified by the Wayland compositor. <strong>-output
<em>name</em></strong> Specifies on which output <em>Xwayland fullscreen rootful should
be placed.</em> The name must match the name of an existing Wayland output
(output names can be found using wayland-info).

If no matching output can be found, the Wayland compositor will decide
on which output the fullscreen rootful <em>Xwayland window will be
placed.</em>

This option has no effect if <em>Xwayland is not running fullscreen
rootful.</em></dd>
<dt>
<strong>-rootless</strong>
</dt>
<dd>Run <em>Xwayland rootless, so that X clients integrate
seamlessly with</em> Wayland clients in a Wayland desktop. That requires
the Wayland server to be an X window manager as well.</dd>
<dt>
<strong>-shm</strong>
</dt>
<dd>Force the shared memory backend instead of glamor (if
available) for passing buffers to the Wayland server.

This option is not compatible with <em>-glamor option.</em></dd>
<dt>
<strong>-verbose</strong> [/n]/
</dt>
<dd>Sets the verbosity level for information printed
on stderr. If the <em>n</em> value isn&#39;t supplied, each occurrence of this
option increments the verbosity level. When the <em>n</em> value is supplied,
the verbosity level is set to that value. The default verbosity level
is 0.</dd>
<dt>
<strong>-version</strong>
</dt>
<dd>Show the server version and exit.</dd>
<dt>
<strong>-wm <em>fd</em></strong>
</dt>
<dd>This option is used by the <em>Wayland server to pass
Xwayland</em> the socket where the X window manager client connects, when
<em>Xwayland</em> is running with <em>-rootless.</em></dd>
</dl>
</div>
</div>
<div id="outline-container-headline-4" class="outline-2">
<h2 id="headline-4">
ENVIRONMENT
</h2>
<div id="outline-text-headline-4" class="outline-text-2">
<dl>
<dt>
<strong>WAYLAND_DISPLAY</strong>
</dt>
<dd>the name of the display of the Wayland server.</dd>
<dt>
<strong>XWAYLAND_NO_GLAMOR</strong>
</dt>
<dd>disable glamor and DRI3 support in <em>Xwayland,
for testing purposes.</em></dd>
</dl>
</div>
</div>
<div id="outline-container-headline-5" class="outline-2">
<h2 id="headline-5">
SEE ALSO
</h2>
<div id="outline-text-headline-5" class="outline-text-2">
<p>General information: <em>X(7), wayland-info(7)</em></p>
</div>
</div>


        </main>
        <footer class="container footer">
            <p>Copyright 2024. All rights reserved.</p>

        </footer>

        
        

        
            <script src="/js/main.95916b5b8c09add4922ea47e674b5da7fc4b6347a3e8c4e25e98b4b7d236080b.js" integrity="sha256-lZFrW4wJrdSSLqR&#43;Z0tdp/xLY0ej6MTiXpi0t9I2CAs=" crossorigin="anonymous"></script>
    </body>
</html>
